
### :robot: Terraform Report
---
##### Plan: `8` to add, `0` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_app.rekor-monitor will be created
  + resource "digitalocean_app" "rekor-monitor" {
      + active_deployment_id = (known after apply)
      + created_at           = (known after apply)
      + default_ingress      = (known after apply)
      + id                   = (known after apply)
      + live_url             = (known after apply)
      + updated_at           = (known after apply)

      + spec {
          + domains = (known after apply)
          + name    = "rekor-monitor"
          + region  = "fra"

          + database {
              + cluster_name = "app-acd8ae2b-31d1-4da7-b4d5-2203ba9a3f8d"
              + db_name      = "rekord-monitor-dev"
              + db_user      = "rekord-monitor-dev"
              + engine       = "PG"
              + name         = "rekord-monitor-dev"
              + production   = true
            }

          + service {
              + dockerfile_path    = "Dockerfile.grafana"
              + http_port          = 3000
              + instance_count     = 1
              + instance_size_slug = "basic-xxs"
              + name               = "grafana"
              + run_command        = (known after apply)
              + source_dir         = "/"

              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }

              + github {
                  + branch         = "master"
                  + deploy_on_push = true
                  + repo           = "flxw/rekor-monitor"
                }
            }

          + worker {
              + dockerfile_path    = "Dockerfile"
              + instance_count     = 1
              + instance_size_slug = "basic-xxs"
              + name               = "rekor-crawler"

              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }
              + env {
                  # At least one attribute in this block is (or was) sensitive,
                  # so its contents will not be displayed.
                }

              + github {
                  + branch         = "master"
                  + deploy_on_push = false
                  + repo           = "flxw/rekor-monitor"
                }
            }
        }
    }

  # digitalocean_database_cluster.postgres-cluster will be created
  + resource "digitalocean_database_cluster" "postgres-cluster" {
      + database             = (known after apply)
      + engine               = "pg"
      + host                 = (known after apply)
      + id                   = (known after apply)
      + name                 = "app-acd8ae2b-31d1-4da7-b4d5-2203ba9a3f8d"
      + node_count           = 1
      + password             = (sensitive value)
      + port                 = (known after apply)
      + private_host         = (known after apply)
      + private_network_uuid = (known after apply)
      + private_uri          = (sensitive value)
      + region               = "fra1"
      + size                 = "db-s-1vcpu-1gb"
      + uri                  = (sensitive value)
      + urn                  = (known after apply)
      + user                 = (known after apply)
      + version              = "12"
    }

  # digitalocean_database_db.grafana-db will be created
  + resource "digitalocean_database_db" "grafana-db" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "grafana"
    }

  # digitalocean_database_db.monitor-db will be created
  + resource "digitalocean_database_db" "monitor-db" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "rekord-monitor-dev"
    }

  # digitalocean_database_user.grafana will be created
  + resource "digitalocean_database_user" "grafana" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "grafana-read"
      + password   = (sensitive value)
      + role       = (known after apply)
    }

  # digitalocean_database_user.grafana-db-user will be created
  + resource "digitalocean_database_user" "grafana-db-user" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "grafana-db-user"
      + password   = (sensitive value)
      + role       = (known after apply)
    }

  # digitalocean_database_user.monitor-db-user will be created
  + resource "digitalocean_database_user" "monitor-db-user" {
      + cluster_id = (known after apply)
      + id         = (known after apply)
      + name       = "rekord-monitor-dev"
      + password   = (sensitive value)
      + role       = (known after apply)
    }

  # digitalocean_vpc.default-fra1 will be created
  + resource "digitalocean_vpc" "default-fra1" {
      + created_at = (known after apply)
      + default    = (known after apply)
      + id         = (known after apply)
      + ip_range   = (known after apply)
      + name       = "default-fra1"
      + region     = "fra1"
      + urn        = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

```
</details>

<details><summary>Show Diff</summary>

```diff
Index: digitalocean_app.rekor-monitor
===================================================================
--- digitalocean_app.rekor-monitor
+++ digitalocean_app.rekor-monitor
@@ -1,1 +1,96 @@
-""
+spec:
+  - alert: []
+    database:
+      - cluster_name: app-acd8ae2b-31d1-4da7-b4d5-2203ba9a3f8d
+        db_name: rekord-monitor-dev
+        db_user: rekord-monitor-dev
+        engine: PG
+        name: rekord-monitor-dev
+        production: true
+        version: null
+    env: []
+    job: []
+    name: rekor-monitor
+    region: fra
+    service:
+      - alert: []
+        build_command: null
+        cors: []
+        dockerfile_path: Dockerfile.grafana
+        env:
+          - key: DB_NAME
+            scope: RUN_AND_BUILD_TIME
+            value: rekord-monitor-dev
+          - key: DB_SSL_MODE
+            scope: RUN_AND_BUILD_TIME
+            value: require
+          - key: DB_URL
+            scope: RUN_AND_BUILD_TIME
+            type: SECRET
+          - key: DB_USER_NAME
+            scope: RUN_AND_BUILD_TIME
+            value: rekord-monitor-dev
+          - key: DB_USER_PASSWORD
+            scope: RUN_AND_BUILD_TIME
+          - key: GF_DATABASE_SSL_MODE
+            scope: RUN_AND_BUILD_TIME
+            value: require
+          - key: GF_DATABASE_TYPE
+            scope: RUN_AND_BUILD_TIME
+            value: postgres
+          - key: GF_DATABASE_URL
+            scope: RUN_AND_BUILD_TIME
+            type: SECRET
+          - key: GF_FEATURE_TOGGLES_ENABLE
+            scope: RUN_AND_BUILD_TIME
+            value: publicDashboards
+          - key: GF_SECURITY_ADMIN_PASSWORD
+            scope: RUN_AND_BUILD_TIME
+            value: Celonis-1337
+          - key: GF_SECURITY_ADMIN_USER
+            scope: RUN_AND_BUILD_TIME
+            value: felix
+        environment_slug: null
+        git: []
+        github:
+          - branch: master
+            deploy_on_push: true
+            repo: flxw/rekor-monitor
+        gitlab: []
+        health_check: []
+        http_port: 3000
+        image: []
+        instance_count: 1
+        instance_size_slug: basic-xxs
+        internal_ports: null
+        log_destination: []
+        name: grafana
+        source_dir: /
+    static_site: []
+    worker:
+      - alert: []
+        build_command: null
+        dockerfile_path: Dockerfile
+        env:
+          - key: DATABASE_URL
+            scope: RUN_AND_BUILD_TIME
+            type: SECRET
+          - key: REKOR_START_INDEX
+            scope: RUN_AND_BUILD_TIME
+            type: ""
+            value: "24686621"
+        environment_slug: null
+        git: []
+        github:
+          - branch: master
+            deploy_on_push: false
+            repo: flxw/rekor-monitor
+        gitlab: []
+        image: []
+        instance_count: 1
+        instance_size_slug: basic-xxs
+        log_destination: []
+        name: rekor-crawler
+        run_command: null
+        source_dir: null
+timeouts: null

```

```diff
Index: digitalocean_database_cluster.postgres-cluster
===================================================================
--- digitalocean_database_cluster.postgres-cluster
+++ digitalocean_database_cluster.postgres-cluster
@@ -1,1 +1,11 @@
-""
+engine: pg
+eviction_policy: null
+maintenance_window: []
+name: app-acd8ae2b-31d1-4da7-b4d5-2203ba9a3f8d
+node_count: 1
+region: fra1
+size: db-s-1vcpu-1gb
+sql_mode: null
+tags: null
+timeouts: null
+version: "12"

```

```diff
Index: digitalocean_database_db.grafana-db
===================================================================
--- digitalocean_database_db.grafana-db
+++ digitalocean_database_db.grafana-db
@@ -1,1 +1,1 @@
-""
+name: grafana

```

```diff
Index: digitalocean_database_db.monitor-db
===================================================================
--- digitalocean_database_db.monitor-db
+++ digitalocean_database_db.monitor-db
@@ -1,1 +1,1 @@
-""
+name: rekord-monitor-dev

```

```diff
Index: digitalocean_database_user.grafana
===================================================================
--- digitalocean_database_user.grafana
+++ digitalocean_database_user.grafana
@@ -1,1 +1,2 @@
-""
+mysql_auth_plugin: null
+name: grafana-read

```

```diff
Index: digitalocean_database_user.grafana-db-user
===================================================================
--- digitalocean_database_user.grafana-db-user
+++ digitalocean_database_user.grafana-db-user
@@ -1,1 +1,2 @@
-""
+mysql_auth_plugin: null
+name: grafana-db-user

```

```diff
Index: digitalocean_database_user.monitor-db-user
===================================================================
--- digitalocean_database_user.monitor-db-user
+++ digitalocean_database_user.monitor-db-user
@@ -1,1 +1,2 @@
-""
+mysql_auth_plugin: null
+name: rekord-monitor-dev

```

```diff
Index: digitalocean_vpc.default-fra1
===================================================================
--- digitalocean_vpc.default-fra1
+++ digitalocean_vpc.default-fra1
@@ -1,1 +1,4 @@
-""
+description: null
+name: default-fra1
+region: fra1
+timeouts: null

```
</details>

---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#6291963446`](https://github.com/flxw/rekor-monitor-tf/actions/runs/6291963446) - commit 153b6b6963a8e8775fe5943c3368a3abcfe885be
